# Задание №1. Создайте несколько переменных разных типов.
# Проверьте к какому типу относятся созданные переменные.


a = 15
b = 'string'
c = (1, 4, 3, 8, 2)
d = {1: 2, 5: 8}
e = [5, 4, 8, 5, 6, 5, 8]
print(f' a - {type(a)},\n b - {type(b)},\n c - {type(c)},\n d - {type(d)},\n e - {type(e)}')
